In [207]:
import pandas as pd
pd.__version__

'1.5.1'

In [208]:
# Create Series from array
import pandas as pd 
import numpy as np
data = np.array(['python','php','java'])
series = pd.Series(data)
print (series)

0    python
1       php
2      java
dtype: object

In [209]:
# Create a Dict from a input
data = {'Courses' :"pandas", 'Fees' : 20000, 'Duration' : "30days"}
s2 = pd.Series(data)
print (s2)

Courses     pandas
Fees         20000
Duration    30days
dtype: object

In [210]:
#Creating DataFrame from List
data = ['python','php','java']
s2 = pd.Series(data, index=['r1', 'r2','r3'])
print(s2)

r1    python
r2       php
r3      java
dtype: object

In [211]:
# Create pandas DataFrame from List
import pandas as pd
technologies = [ ["Spark",20000, "30days"], 
                 ["Pandas",25000, "40days"], 
               ]
df=pd.DataFrame(technologies)
print(df)

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [212]:
# Creates DataFrame from list of dict
technologies = [{'Courses':'Spark', 'Fee': 20000, 'Duration':'30days'},
        {'Courses':'Pandas', 'Fee': 25000, 'Duration': '40days'}]

df = pd.DataFrame(technologies)
print(df)

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

In [213]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }
index_labels=['r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [214]:
print(df.loc['r2'])

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [215]:
# Select Rows by Index Label List
print(df.loc[['r2','r3','r6']])

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r6   Oracle  21000     None      2100

In [216]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [217]:
#Following is the syntax of DataFrame.query() method.\\
# query() method syntax
# Query all rows with Courses equals 'Spark'
df2=df.query("Courses == 'Spark'")
print(df2)

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [218]:
# Query Rows by using Python variable
value='Spark'
df2=df.query("Courses == @value")
print(df2)

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [219]:
# Replace current esisting DataFrame
df.query("Courses == 'Spark'",inplace=True)
print(df)

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [220]:

# Query Rows by list of values
print(df.query("Courses in ('Spark','PySpark')"))

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [221]:
# Query Rows not in list of values
values=['Spark','PySpark']
print(df.query("Courses not in @values"))

Empty DataFrame
Columns: [Courses, Fee, Duration, Discount]
Index: []

In [222]:

# By using lambda function
print(df.apply(lambda row: row[df['Courses'].isin(['Spark','PySpark'])]))

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [223]:
# Belwo are quick example 
# Using loc[]. Get cell value by name & index
print(df.loc['r4']['Duration'])
print(df.loc['r4'][2])

# Using iloc[]. Get cell value by index & name
print(df.iloc[3]['Duration'])
print(df.iloc[3,2])


# Using DataFrame.at[]
print(df.at['r4','Duration'])
print(df.at[df.index[3],'Duration'])

# Using DataFrame.iat[]
print(df.iat[3,2])

#Get a cell value
print(df["Duration"].values[3])

KeyError: 'r4'

In [ ]:
print(df.iloc[3]['Duration'])

40days

In [ ]:
# Quick Examples of Add Column to DataFrame

In [ ]:
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1000,2300,1000,1200,2500]
          }

df = pd.DataFrame(technologies)
print(df)

   Courses    Fee  Discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000
3   Python  24000      1200
4   Pandas  26000      2500

In [ ]:
# Add new column to the DataFrame
#assign is a keyword for adding a column in dataset
tutors = ['William', 'Henry', 'Michael', 'John', 'Messi']
df2 = df.assign(TutorsAssigned=tutors)

df2

   Courses    Fee  Discount TutorsAssigned
0    Spark  22000      1000        William
1  PySpark  25000      2300          Henry
2   Hadoop  23000      1000        Michael
3   Python  24000      1200           John
4   Pandas  26000      2500          Messi

In [ ]:
# Add multiple columns to the DataFrame
MNCCompanies = ['TATA','HCL','Infosys','Google','Amazon']
df2 = df.assign(MNCComp = MNCCompanies,TutorsAssigned=tutors )
df2

   Courses    Fee  Discount  MNCComp TutorsAssigned
0    Spark  22000      1000     TATA        William
1  PySpark  25000      2300      HCL          Henry
2   Hadoop  23000      1000  Infosys        Michael
3   Python  24000      1200   Google           John
4   Pandas  26000      2500   Amazon          Messi

In [ ]:

# Derive New Column from Existing Column
df = pd.DataFrame(technologies)
df4 = df.assign(Discount_Percent=lambda x: x.Fee * x.Discount / 100)
print(df4)

   Courses    Fee  Discount  Discount_Percent
0    Spark  22000      1000          220000.0
1  PySpark  25000      2300          575000.0
2   Hadoop  23000      1000          230000.0
3   Python  24000      1200          288000.0
4   Pandas  26000      2500          650000.0

In [ ]:
# Add a constant or empty value to the DataFrame.
df = pd.DataFrame(technologies)
df2=df.assign(A=None,B=0,C="")
df2[df2]
print(df2)

   Courses    Fee  Discount     A  B C
0    Spark  22000      1000  None  0
1  PySpark  25000      2300  None  0
2   Hadoop  23000      1000  None  0
3   Python  24000      1200  None  0
4   Pandas  26000      2500  None  0

In [ ]:
# Add New column to the existing DataFrame
df2 = pd.DataFrame(technologies)
df2["MNCCompanies"] = MNCCompanies
print(df2)

   Courses    Fee  Discount MNCCompanies
0    Spark  22000      1000         TATA
1  PySpark  25000      2300          HCL
2   Hadoop  23000      1000      Infosys
3   Python  24000      1200       Google
4   Pandas  26000      2500       Amazon

In [ ]:
# Add new column at the specific position
df = pd.DataFrame(technologies)
df.insert(0,'Tutors', tutors )
print(df)

    Tutors  Courses    Fee  Discount
0  William    Spark  22000      1000
1    Henry  PySpark  25000      2300
2  Michael   Hadoop  23000      1000
3     John   Python  24000      1200
4    Messi   Pandas  26000      2500

In [ ]:
# Add new column by mapping to the existing column
df = pd.DataFrame(technologies)
tutors = {"Spark":"William", "PySpark":"Henry", "Hadoop":"Michael","Python":"John", "pandas":"Messi"}
df['Tutors'] = df['Courses'].map(tutors)
print(df)

   Courses    Fee  Discount   Tutors
0    Spark  22000      1000  William
1  PySpark  25000      2300    Henry
2   Hadoop  23000      1000  Michael
3   Python  24000      1200     John
4   Pandas  26000      2500      NaN

In [ ]:
import pandas as pd
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days']
              })
df = pd.DataFrame(technologies)
print(df.columns)

Index(['Courses', 'Fee', 'Duration'], dtype='object')

In [ ]:
# Rename a Single Column 
df2=df.rename(columns = {'Courses':'Courses_List'})
print(df2.columns)

Index(['Courses_List', 'Fee', 'Duration'], dtype='object')

In [ ]:
df2

  Courses_List    Fee Duration
0        Spark  20000    30day
1      PySpark  25000   40days
2       Hadoop  26000   35days
3       Python  22000   40days
4       pandas  24000   60days
5       Oracle  21000   50days
6         Java  22000   55days

In [ ]:

# Alternatively you can write above using axis
df2=df.rename({'Courses':'Course'}, axis=1)

In [ ]:
df2

    Course    Fee Duration
0    Spark  20000    30day
1  PySpark  25000   40days
2   Hadoop  26000   35days
3   Python  22000   40days
4   pandas  24000   60days
5   Oracle  21000   50days
6     Java  22000   55days

In [ ]:
df2=df.rename({'Courses':'Courses_List'}, axis='columns')
df2

  Courses_List    Fee Duration
0        Spark  20000    30day
1      PySpark  25000   40days
2       Hadoop  26000   35days
3       Python  22000   40days
4       pandas  24000   60days
5       Oracle  21000   50days
6         Java  22000   55days

In [ ]:
# Rename multiple columns
df.rename(columns = {'Courses':'Courses_List','Fee':'Courses_Fee', 
   'Duration':'Courses_Duration'}, inplace = True)
print(df.columns)

Index(['Courses_List', 'Courses_Fee', 'Courses_Duration'], dtype='object')

In [ ]:
df

  Courses_List  Courses_Fee Courses_Duration
0        Spark        20000            30day
1      PySpark        25000           40days
2       Hadoop        26000           35days
3       Python        22000           40days
4       pandas        24000           60days
5       Oracle        21000           50days
6         Java        22000           55days

In [ ]:
# pandas rename column by index
c =df.columns.values[2] = "Courses_time"
c

'Courses_time'

In [ ]:
df

  Courses_List  Courses_Fee Courses_time
0        Spark        20000        30day
1      PySpark        25000       40days
2       Hadoop        26000       35days
3       Python        22000       40days
4       pandas        24000       60days
5       Oracle        21000       50days
6         Java        22000       55days

In [ ]:
# drop a columns
import pandas as pd
import numpy as np

technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python"],
    'Fee' :[20000,25000,26000,22000],
    'Duration':['30day','40days',np.nan, None],
    'Discount':[1000,2300,1500,1200]
               }

indexes=['r1','r2','r3','r4']
df = pd.DataFrame(technologies,index=indexes)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:

# Drop rows by Index Label
df = pd.DataFrame(technologies,index=indexes)
df1 = df.drop(['r1','r2'],inplace=True)
print(df1)

None

In [ ]:
df1

In [ ]:
df

   Courses    Fee Duration  Discount
r3  Hadoop  26000      NaN      1500
r4  Python  22000     None      1200

In [ ]:
# Delete Rows inplace
df = pd.DataFrame(technologies,index=indexes)
df.drop(['r1'],inplace=True)
print(df)

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:
#Using drop() to delete rows based on column value
show1 =df.drop(df[df['Fee'] >= 21000].index, inplace = True)
show1

In [ ]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:
# Remove rows
df2 = df[df.Fee >= 24000]
df2

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500

In [ ]:

# Another alternate approach by using DataFrame.apply()
print(df.apply(lambda a: str(a["Fee"]) + " " + str(a["Courses"]), axis = 1))

r1      20000 Spark
r2    25000 PySpark
r3     26000 Hadoop
r4     22000 Python
dtype: object

In [ ]:
# Using DataFrame.index
for da in df.index:
     print(df['Fee'][da], df['Courses'][da])

20000 Spark
25000 PySpark
26000 Hadoop
22000 Python

In [ ]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000      NaN      1500
r4   Python  22000     None      1200

In [ ]:

import pandas as pd
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [ ]:
# Use groupby() to compute the sum
df2 =df.groupby(['Courses']).sum()
print(df2)

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15316\1138727665.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2 =df.groupby(['Courses']).sum()

In [ ]:

# Group by multiple columns
df2 =df.groupby(['Courses', 'Duration']).sum()
print(df2)

                    Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days    24000    1200.0
        50days    22000    1600.0
Spark   30days    47000    2400.0

In [ ]:

# Add Row Index to the group by result
df2 = df.groupby(['Courses','Duration']).sum().reset_index()
print(df2)

   Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

In [ ]:
# Remove sorting on grouped results
df2=df.groupby(by=['Courses'], sort=True).sum()
print(df2)

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15316\1241031633.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2=df.groupby(by=['Courses'], sort=True).sum()

In [ ]:
# Groupby & multiple aggregations
result = df.groupby('Courses')['Fee'].aggregate(['min','max'])
print(result)

           min    max
Courses
Hadoop   23000  25000
NA        1500   1500
Pandas   26000  26000
PySpark  25000  25000
Python   22000  24000
Spark    22000  25000

In [ ]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','NaN','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)

technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [ ]:
df1

    Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Python  22000   35days
r4   pandas  30000   50days

In [ ]:
df2

   Courses  Discount
r1   Spark      2000
r6    Java      2300
r3  Python      1200
r5      Go      2000

In [ ]:
# pandas join 
df3=df1.join(df2,rsuffix="_right", lsuffix="_left")
print(df3)

   Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark    2000.0
r2      PySpark  25000   40days           NaN       NaN
r3       Python  22000   35days        Python    1200.0
r4       pandas  30000   50days           NaN       NaN

In [ ]:
# pandas Inner join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='inner')
print(df3)

   Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark      2000
r3       Python  22000   35days        Python      1200

In [ ]:
# pandas Right join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='right')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark      2000
r6          NaN      NaN      NaN          Java      2300
r3       Python  22000.0   35days        Python      1200
r5          NaN      NaN      NaN            Go      2000

In [ ]:
# pandas outer join DataFrames
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='outer')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark    2000.0
r2      PySpark  25000.0   40days           NaN       NaN
r3       Python  22000.0   35days        Python    1200.0
r4       pandas  30000.0   50days           NaN       NaN
r5          NaN      NaN      NaN            Go    2000.0
r6          NaN      NaN      NaN          Java    2300.0

In [ ]:

# pandas join on columns
df3=df1.set_index('Courses').join(df2.set_index('Courses'))
print(df3)

           Fee Duration  Discount
Courses
Spark    20000   30days    2000.0
PySpark  25000   40days       NaN
Python   22000   35days    1200.0
pandas   30000   50days       NaN

In [ ]:
# pandas join
df3=df1.join(df2.set_index('Courses'), how='inner', on='Courses')
print(df3)

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      2000
r3  Python  22000   35days      1200

In [ ]:
# Using pandas.merge()
df3= pd.merge(df1,df2)
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [ ]:
# Using DataFrame.merge()
df3=df1.merge(df2)
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [ ]:
# Using pandas.concat() to concat two DataFrames
data = [df, df1]
df2 = pd.concat(data)
print(df2)

    Courses    Fee Duration  Discount
0     Spark  22000   30days    1000.0
1   PySpark  25000   50days    2300.0
2    Hadoop  23000   55days    1000.0
3    Python  24000   40days    1200.0
4    Pandas  26000   60days    2500.0
5    Hadoop  25000   35days       NaN
6     Spark  25000   30days    1400.0
7    Python  22000   50days    1600.0
8        NA   1500   40days       0.0
r1    Spark  20000   30days       NaN
r2  PySpark  25000   40days       NaN
r3   Python  22000   35days       NaN
r4   pandas  30000   50days       NaN

In [ ]:
# Using append() method
df2 = df.append(df1)
print(df2)

    Courses    Fee Duration  Discount
0     Spark  22000   30days    1000.0
1   PySpark  25000   50days    2300.0
2    Hadoop  23000   55days    1000.0
3    Python  24000   40days    1200.0
4    Pandas  26000   60days    2500.0
5    Hadoop  25000   35days       NaN
6     Spark  25000   30days    1400.0
7    Python  22000   50days    1600.0
8        NA   1500   40days       0.0
r1    Spark  20000   30days       NaN
r2  PySpark  25000   40days       NaN
r3   Python  22000   35days       NaN
r4   pandas  30000   50days       NaN

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15316\3921087216.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2 = df.append(df1)

In [ ]:
# very important function fillna()


# Create DataFrame
import pandas as pd
import numpy as np
df = pd.DataFrame(({
     'Courses':["Spark",'Java',"Scala",'Python'],
     'Fee' :[20000,np.nan,26000,24000],
     'Duration':['30days','40days','NaN','40days'],
     'Discount':[1000,np.nan,2500,None]
               }))
print(df)

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      NaN   40days       NaN
2   Scala  26000.0      NaN    2500.0
3  Python  24000.0   40days       NaN

In [ ]:

# fillna to replace all NaN
df2=df.fillna('None',inplace=True)
print(df2)

None

In [ ]:
df

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java     None   40days     None
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days     None

In [ ]:
df2=df.fillna('Na',inplace=True)
print(df2)

None

In [ ]:
df

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java       Na   40days       Na
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days       Na

In [ ]:

# fillna() on multiple columns
df2 =  df.fillna(value={'Discount':'0','Fee':10000})
print(df2)

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java       Na   40days       Na
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days       Na

In [ ]:
df

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java       Na   40days       Na
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days       Na

In [ ]:
df=df.dropna(how='all')
df

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      NaN   40days       NaN
2   Scala  26000.0      NaN    2500.0
3  Python  24000.0   40days       NaN

In [ ]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    'Empty':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount  Empty
r1    Spark  20000.0    30day     1000    NaN
r2  PySpark  25000.0   40days      NaN    NaN
r3   Hadoop  26000.0   35days     1200    NaN
r4   Python  23093.0   45days     2500    NaN
r5   pandas  24000.0      NaN      NaT    NaN
        NaN      NaN      NaN      NaN    NaN

In [ ]:
# Drop rows that has all Nan Values
df = df.dropna(how='all')
print(df)

    Courses      Fee Duration Discount  Empty
r1    Spark  20000.0    30day     1000    NaN
r2  PySpark  25000.0   40days      NaN    NaN
r3   Hadoop  26000.0   35days     1200    NaN
r4   Python  23093.0   45days     2500    NaN
r5   pandas  24000.0      NaN      NaT    NaN

In [ ]:
# Drop columns that has all Nan Values
df = df.dropna(how='all',axis=1)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [ ]:
# Drop rows that contains nan values
df2=df.dropna()
print(df2)

   Courses      Fee Duration Discount
r1   Spark  20000.0    30day     1000
r3  Hadoop  26000.0   35days     1200
r4  Python  23093.0   45days     2500

In [ ]:
df

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [ ]:

# Drop rows that has NaN values on selected columns
df2=df.dropna(subset=['Courses'])
print(df2)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

                    Pandas apply() with Lambda Examples

pandas.DataFrame.apply() can be used with python lambda to execute expression. A lambda function in python is a small anonymous function that can take any number of arguments and execute an expression.

In this article I will explain how to use a pandas DataFrame.apply() with lambda by examples. lambda expressions are utilized to construct anonymous functions. You can create one by using the lambda keyword.

In [224]:
import pandas as pd
import numpy as np
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [225]:

# apply a lambda function to each column
df2 = df.apply(lambda x : x + 10)
print(df2)

    A   B   C
0  13  15  17
1  12  14  16
2  15  18  19

In [226]:
# Using Dataframe.apply() and lambda function
df["A"] = df["A"].apply(lambda x: x-2)
print(df)

   A  B  C
0  1  5  7
1  0  4  6
2  3  8  9

5. Using pandas.DataFrame.map() with Lambda to Single Column

In [4]:
import numpy as np
import pandas as pd
s = pd.Series(['1. Bat.  ', '2. Dog!\n', '3. fox?\t','Nan $', np.nan])
s

0    1. Bat.
1    2. Dog!\n
2    3. fox?\t
3        Nan $
4          NaN
dtype: object

In [13]:
s.str.strip('123.!? $ \n\t')

0    Bat
1    Dog
2    fox
3    Nan
4    NaN
dtype: object